Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/command-console/source/wifi_utility/COMPONENT_WCM/wifi_utility.c
int stop_ap(int argc, char* argv[], tlv_buffer_t** data)
{
    cy_rslt_t res;
    WIFI_INFO(("stop_ap start\n"));
    res = cy_wcm_stop_ap();
    if(res != CY_RSLT_SUCCESS)
    {
        WIFI_ERROR(("Failed to stop_ap. Res:0x%x", (unsigned int)res));
        return -1;
    }

    WIFI_INFO(("stop_ap successful!\n"));
    return 0;
}

int get_sta_ifconfig(int argc, char* argv[], tlv_buffer_t** data)
{
    cy_rslt_t res, result;
    cy_wcm_ip_address_t ip_addr;
    uint8_t mac[6] = {0};

    res = cy_wcm_get_ip_addr(CY_WCM_INTERFACE_TYPE_STA, &ip_addr);
    if (res != CY_RSLT_SUCCESS)
    {
         WIFI_INFO(("cy_wcm_get_ip_addr failed...! with error: [0x%X]\n", (unsigned int)res));
    }
    else
    {
         print_ip4(ip_addr.ip.v4);
    }
    result = cy_wcm_get_mac_addr(CY_WCM_INTERFACE_TYPE_STA, &mac);
    if (result != CY_RSLT_SUCCESS)
    {
         WIFI_INFO(("STA MAC Address failed result:0x%X\n", (unsigned int)result));
    }
    else
    {
         WIFI_INFO(("MAC Address: %02X:%02X:%02X:%02X:%02X:%02X\n", mac[0],mac[1],mac[2],mac[3],mac[4],mac[5]));
    }
    return 0;
}

static cy_rslt_t start_ap_common(const char *ssid, const char *key, uint8_t channel, cy_wcm_security_t security_type, cy_wcm_custom_ie_info_t *custom_ie, cy_wcm_wifi_band_t band)
{
    cy_rslt_t result;
    cy_wcm_ap_config_t ap_params;
    cy_wcm_ip_address_t ipv4_addr;

    memset(&ap_params, 0, sizeof(cy_wcm_ap_config_t));
    memcpy(ap_params.ap_credentials.SSID, ssid, strlen(ssid) + 1);
    memcpy(ap_params.ap_credentials.password, key, strlen(key) + 1);
    ap_params.ap_credentials.security = security_type;
    ap_params.channel = channel;
#ifdef WIFI_6G_CAPABLE 
    ap_params.band = band;
#endif
    ap_params.ip_settings.ip_address = ap_ip_settings.ip_address;
    ap_params.ip_settings.gateway = ap_ip_settings.gateway;
    ap_params.ip_settings.netmask = ap_ip_settings.netmask;
    if (custom_ie)
    {
        WIFI_INFO(("Setting custom IE\n"));
        ap_params.ie_info = custom_ie;
        WIFI_INFO(("custom_ie.subtype = %d \n", ap_params.ie_info->subtype));
        WIFI_INFO(("custom_ie.length = %d \n", ap_params.ie_info->length));
        WIFI_INFO(("custom_ie.ie_packet_mask  = %d \n", ap_params.ie_info->ie_packet_mask));
        WIFI_INFO(("custom_ie->data  = %s \n", (char *)ap_params.ie_info->data));
    }
    result = cy_wcm_start_ap(&ap_params);
    if (result != CY_RSLT_SUCCESS)
    {
        WIFI_INFO(("WCM AP start failed with error: [0x%X]\n", (unsigned int)result));
        return result;
    }
    WIFI_INFO(("WCM AP started\n"));
    result = cy_wcm_get_ip_addr(CY_WCM_INTERFACE_TYPE_AP, &ipv4_addr);
    if (result != CY_RSLT_SUCCESS)
    {
        WIFI_INFO(("cy_wcm_get_ip_addr failed...! with error: [0x%X]\n", (unsigned int)result));
        return result;
    }
    print_ip4(ap_params.ip_settings.ip_address.ip.v4);
    return CY_RSLT_SUCCESS;
}

void scan_result_cb(cy_wcm_scan_result_t *result_ptr, void *user_data, cy_wcm_scan_status_t status)
{
    if(status == CY_WCM_SCAN_INCOMPLETE)
    {
        WIFI_INFO(("%-20s %-14s %-10d %-7d %02X:%02X:%02X:%02X:%02X:%02X",
        result_ptr->SSID,
        wifi_utils_authtype_to_str(result_ptr->security),
        result_ptr->signal_strength,
        result_ptr->channel,
        result_ptr->BSSID[0],
        result_ptr->BSSID[1],
        result_ptr->BSSID[2],
        result_ptr->BSSID[3],
        result_ptr->BSSID[4],
        result_ptr->BSSID[5]));

        if(user_data != NULL)
        {
            WIFI_DEBUG((" message = %s ", (char*)user_data));
        }

#if IE_DATA_PRINTS
        int i = 0;
        WIFI_DEBUG((" ie len = %lu data: ", (unsigned long)result_ptr->ie_len));
        for(i=0; i<result_ptr->ie_len; i++)
        {
            WIFI_DEBUG(("%02x ", result_ptr->ie_ptr[i]));
        }
#endif
        WIFI_INFO(("\n"));
    }
    else if(status == CY_WCM_SCAN_COMPLETE)
    {
        WIFI_INFO(("#### Scan Results END ####\n\n"));
    }
}

int convert_to_wcm_connect_params(int argc, char* argv[], cy_wcm_connect_params_t* connect_params)
{
    memset(connect_params, 0, sizeof(cy_wcm_connect_params_t));

    // command format: join <ssid> <sec type> [key] [channel/band]
    if(argc < 3)
    {
        WIFI_ERROR(("Insufficient number of arguments. Command format: join <ssid> <sec type> [key] [channel/band]\n"));
        return -1;
    }

    if(strlen(argv[1]) >= CMD_CONSOLE_SSID_MAX_LENGTH)
    {
        WIFI_ERROR(("SSID length should be lesser than [%d] bytes.\n", CMD_CONSOLE_SSID_MAX_LENGTH));
        return -1;
    }

    // ssid
    memcpy(connect_params->ap_credentials.SSID, argv[1], strlen(argv[1]) + 1);

    // security type
    connect_params->ap_credentials.security = wifi_utils_str_to_authtype(argv[2]);
    if(connect_params->ap_credentials.security == CY_WCM_SECURITY_UNKNOWN)
    {
        WIFI_ERROR(("Cannot connect due to unsupported auth type.\n"));
        return -1;
    }

    // passkey
    if(connect_params->ap_credentials.security != CY_WCM_SECURITY_OPEN)
    {
        if(argc < 4)
        {
            WIFI_ERROR(("Insufficient number of arguments.\n"));
            return -1;
        }
        if(strlen(argv[3]) >= CMD_CONSOLE_PASS_MAX_LENGTH)
        {
            WIFI_ERROR(("Password length should be lesser than [%d] bytes.\n", CMD_CONSOLE_PASS_MAX_LENGTH));
            return -1;
        }
        memcpy(connect_params->ap_credentials.password, argv[3], strlen(argv[3]) + 1);
    }

    // channel
    if(argc == 5 && wifi_utils_str_to_band(argv[4], NULL, &connect_params->band) == -1)
    {
        return -1;
    }

    // channel/band
    if(argc == 6 && wifi_utils_str_to_band(argv[4], argv[5], &connect_params->band) == -1)
    {
        return -1;
    }
    return 0;
}

int wifi_utils_str_to_ip(char* ip_str, cy_wcm_ip_address_t* ip_addr)
{
    int bytes[CMD_CONSOLE_IPV4_ADDR_SIZE];
    char* p = NULL;
    char* rest = NULL;
    int i = 0;
    char* delimiter = ".";

    if((ip_str == NULL)||(ip_addr == NULL))
    {
        WIFI_ERROR(("Invalid parameter.\n"));
        return -1;
    }
    memset(&bytes, 0x00, sizeof(bytes));
    rest = ip_str;
    p = strtok_r (rest, delimiter, &rest);
    if(p == NULL)
    {
        WIFI_ERROR(("Invalid IP Addr.\n"));
        return -1;
    }
    bytes[i] = atoi(p);
    WIFI_DEBUG(("bytes[%d]:%d\n", i, bytes[i]));
    while(p != NULL)
    {
        ++i;
        p = strtok_r (rest, delimiter, &rest);
        if(i < CMD_CONSOLE_IPV4_ADDR_SIZE)
        {
            if(p == NULL)
            {
                WIFI_ERROR(("Invalid IP Addr.\n"));
                return -1;
            }
            bytes[i] = atoi(p);
            WIFI_DEBUG(("bytes[%d]:%d\n", i, bytes[i]));
        }
    }

