Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/command-console/source/wifi_utility/COMPONENT_WCM/wifi_utility.c
    if(i != (CMD_CONSOLE_IPV4_ADDR_SIZE))
    {
        WIFI_ERROR(("Invalid IP Addr.\n"));
        return -1;
    }

    ip_addr->version = CY_WCM_IP_VER_V4;
    ip_addr->ip.v4 = (uint32_t)MAKE_IPV4_ADDRESS1(bytes[0], bytes[1], bytes[2], bytes[3]);

    return 0;
}

int wifi_utils_str_to_band(char* channel_str, char* band_str, cy_wcm_wifi_band_t* band)
{
    int channel = atoi(channel_str);
    int band_arg = CY_WCM_WIFI_BAND_ANY;

    if (band_str != NULL)
    {
        band_arg = atoi(band_str);
    }

    if((band_arg == CY_WCM_WIFI_BAND_ANY || band_arg == CY_WCM_WIFI_BAND_2_4GHZ) &&
        (channel >= 1 && channel <= 14))
    {
        *band = CY_WCM_WIFI_BAND_2_4GHZ;
    }
    else if((band_arg == CY_WCM_WIFI_BAND_ANY || band_arg == CY_WCM_WIFI_BAND_5GHZ) &&
        (channel >= 32 && channel <= 165))
    {
        *band = CY_WCM_WIFI_BAND_5GHZ;
    }
#if defined(WIFI_6G_CAPABLE)
    else if((band_arg == CY_WCM_WIFI_BAND_ANY || band_arg == CY_WCM_WIFI_BAND_6GHZ) &&
        (channel >= 1 && channel <= 233))
    {
        *band = CY_WCM_WIFI_BAND_6GHZ;
    }
#endif // defined(WIFI_6G_CAPABLE)
    else
    {
        WIFI_ERROR(("Invalid channel(%d) band(%d). Valid values: 1 to 14 - 2.4GHz, 32 to 165 - 5GHz, 1 to 233 - 6GHz(Please define WIFI_6G_CAPABLE in Makefile)\n",
            channel, band_arg));
        return -1;
    }

    return 0;
}

cy_wcm_security_t wifi_utils_str_to_authtype(char* auth_str)
{
    if (strcmp(auth_str, "open") == 0)
    {
        return CY_WCM_SECURITY_OPEN;
    }
    else if(strcmp(auth_str, "wpa2_tkip") == 0)
    {
        return CY_WCM_SECURITY_WPA2_TKIP_PSK;
    }
    else if(strcmp(auth_str, "wpa2_aes") == 0)
    {
        return CY_WCM_SECURITY_WPA2_AES_PSK;
    }
    else if(strcmp(auth_str, "wpa2_aes_sha256") == 0)
    {
        return CY_WCM_SECURITY_WPA2_AES_PSK_SHA256;
    }
    else if(strcmp(auth_str, "wpa2") == 0)
    {
        return CY_WCM_SECURITY_WPA2_MIXED_PSK;
    }
    else if(strcmp(auth_str, "wpa_aes" ) == 0)
    {
        return CY_WCM_SECURITY_WPA_AES_PSK;
    }
    else if (strcmp(auth_str, "wpa_tkip") == 0)
    {
        return CY_WCM_SECURITY_WPA_TKIP_PSK;
    }
    else if(strcmp(auth_str, "wpa3") == 0)
    {
        return CY_WCM_SECURITY_WPA3_SAE;
    }
    else if(strcmp(auth_str, "wpa3_wpa2") == 0)
    {
        return CY_WCM_SECURITY_WPA3_WPA2_PSK;
    }
    else
    {
        WIFI_ERROR(("Unsupported auth type: '%s'\r\n", auth_str));
        return CY_WCM_SECURITY_UNKNOWN;
    }
}

const char* wifi_utils_authtype_to_str(cy_wcm_security_t sec)
{
    switch (sec)
    {
        case CY_WCM_SECURITY_OPEN:
            return "open";
        case CY_WCM_SECURITY_WEP_PSK:
        case CY_WCM_SECURITY_WEP_SHARED:
            return "wep";
        case CY_WCM_SECURITY_WPA2_MIXED_PSK:
            return "wpa2";
        case CY_WCM_SECURITY_WPA_AES_PSK:
            return "wpa_aes";
        case CY_WCM_SECURITY_WPA2_AES_PSK_SHA256:
            return "wpa2_aes_sha256";
        case CY_WCM_SECURITY_WPA2_AES_PSK:
            return "wpa2_aes";
        case CY_WCM_SECURITY_WPA_TKIP_PSK:
            return "wpa_tkip";
        case CY_WCM_SECURITY_WPA2_TKIP_PSK:
            return "wpa2_tkip";
        case CY_WCM_SECURITY_WPA3_SAE:
            return "wpa3";
        case CY_WCM_SECURITY_WPA3_WPA2_PSK:
            return "wpa3_wpa2";
        case CY_WCM_SECURITY_WPA_AES_ENT:
            return "wpa_aes_ent";
        case CY_WCM_SECURITY_WPA_MIXED_ENT:
            return "wpa_mixed_ent";
        case CY_WCM_SECURITY_WPA2_TKIP_ENT:
            return "wpa2_tkip_ent";
        case CY_WCM_SECURITY_WPA2_AES_ENT:
            return "wpa2_aes_ent";
        case CY_WCM_SECURITY_WPA2_MIXED_ENT:
            return "wpa2_mixed_ent";
        case CY_WCM_SECURITY_WPA2_FBT_ENT:
            return "wpa2_fbt_ent";
#ifdef ENABLE_ENTPS_FEATURE
        case CY_WCM_SECURITY_WPA3_192BIT_ENT:
            return "wpa3_192bit_ent";
        case CY_WCM_SECURITY_WPA3_ENT:
            return "wpa3_aes_gcm_256_ent";
        case CY_WCM_SECURITY_WPA3_ENT_AES_CCMP:
            return "wpa3_aes_ccm_128_ent";
#endif
        case CY_WCM_SECURITY_UNKNOWN:
            return "Unknown";
        default:
            return "Unsupported";
    }
}

static void print_ip4(uint32_t ip)
{
    unsigned char bytes[CMD_CONSOLE_IPV4_ADDR_SIZE];
    bytes[0] = ip & 0xFF;
    bytes[1] = (ip >> 8) & 0xFF;
    bytes[2] = (ip >> 16) & 0xFF;
    bytes[3] = (ip >> 24) & 0xFF;

    WIFI_INFO(("IP Address: %d.%d.%d.%d\n", bytes[0], bytes[1], bytes[2], bytes[3]));
}

#ifdef __cplusplus
}
#endif
#endif
